package by.it.brataniuk.lesson04;

import java.util.Scanner;

/*
Напишите программу которая спрашивает у пользователя:
Какую вы хотите зарплату в $$$?

После ввода суммы, программа анализирует полученное значение
и если введенная цифра меньше 300 или больше 3000 программа выводит на экран:
Мы вам перезвоним!

Иначе выводит в цикле по переменной int month от 0 до 14 рассчитанную зарплату.
В летние месяцы - выводится введенная сумма с названием месяца.
В несуществующие месяцы 0, 13 и 14 выводится сумма в $0.0
в остальные месяцы выводится указанная сумма с премией в 50%.

Сделайте так, чтобы в тот месяц, когда получилась зарплата в $666 цикл после вывода прерывался.

Пример работы программы (у вас должно быть так же, до символа):

Какую вы хотите зарплату в $$$?
2000
За месяц 0 начислено $0.0
За январь начислено $3000.0
За февраль начислено $3000.0
За март начислено $3000.0
За апрель начислено $3000.0
За май начислено $3000.0
За июнь начислено $2000.0
За июль начислено $2000.0
За август начислено $2000.0
За сентябрь начислено $3000.0
За октябрь начислено $3000.0
За ноябрь начислено $3000.0
За декабрь начислено $3000.0
За месяц 13 начислено $0.0
За месяц 14 начислено $0.0

*/
public class TaskC1 {
    public static void main(String[] args) {
        System.out.println("Какую вы хотите зарплату в $$$?");
        Scanner sc = new Scanner(System.in);
        int zp = sc.nextInt();
        if (zp < 300 || zp > 3000) {
            System.out.println("Мы вам перезвоним!");
        } else for (int month = 0; month <= 14; month++) {
            System.out.println("За " + mesac(month) + " начислено $" + zp * kofficient(month));
            if (zp*kofficient(month)==666){
                break;
            }
        }
    }
    public static double kofficient(int n) {
        double k;
        if (n >= 6 && n <= 8) {
            k = 1;
        } else if (n == 0 || n >= 13) {
            k = 0;
        } else k = 1.5D;
        return k;
    }

    public static String mesac(int m) {
        String mes;
        switch (m) {
            case 1:
                mes = "январь";
                break;
            case 2:
                mes = "февраль";
                break;
            case 3:
                mes = "март";
                break;
            case 4:
                mes = "апрель";
                break;
            case 5:
                mes = "май";
                break;
            case 6:
                mes = "июнь";
                break;
            case 7:
                mes = "июль";
                break;
            case 8:
                mes = "август";
                break;
            case 9:
                mes = "сентябрь";
                break;
            case 10:
                mes = "октябрь";
                break;
            case 11:
                mes = "ноябрь";
                break;
            case 12:
                mes = "декабрь";
                break;
            default:
                mes = "месяц " + m;
        }
        return mes;
    }
}

