package by.it.prudnikau.lesson04;

/*
Вывести таблицу умножения 10 x 10 (двоныйм циклом),
но вывод должен быть словами:

Ожидаемый вывод:
два умножить на два равно четыре
два умножить на три равно шесть
два умножить на четыре равно восемь
два умножить на пять равно десять
два умножить на шесть равно двенадцать
два умножить на семь равно четырнадцать
два умножить на восемь равно шестнадцать
два умножить на девять равно восемнадцать
два умножить на десять равно двадцать
три умножить на два равно шесть
три умножить на три равно девять
три умножить на четыре равно двенадцать
...
и т.д. до фразы
...
десять умножить на десять равно сто
*/

import java.util.Arrays;
import java.util.Iterator;
import java.util.List;
import java.util.ArrayList;

public class TaskC3 {
    public static void main(String[] args) {
        String umn = " умножить на ";
        String ravno = " равно ";
        List<String> numbers = Arrays.asList("ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь",
                "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
                "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать", "тридцать", "сорок",
                "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто", "сто");

        String a, b, c;
        for (int i = 2; i < 10; i++) {
            for (int j = 2; j <= 10; j++) {
                int res = i * j;
                String result = "";
                if(res<10&&res<20){
                    result=numbers.get(res);
                }
                if(res>=20&&res<30){
                    result=String.valueOf(res);
                }



                String number = numbers.get(i);
                String number1 = numbers.get(j);
                System.out.println(number + umn + number1 + ravno+result);


            }

        }


    }


}
