package by.it.prudnikau.lesson04;

/*
Напишите программу которая спрашивает у пользователя:
Какую вы хотите зарплату в $$$?

После ввода суммы, программа анализирует полученное значение
и если введенная цифра меньше 300 или больше 3000 программа выводит на экран:
Мы вам перезвоним!

Иначе выводит в цикле по переменной int month от 0 до 14 рассчитанную зарплату.
В летние месяцы - выводится введенная сумма с названием месяца.
В несуществующие месяцы 0, 13 и 14 выводится сумма в $0.0
в остальные месяцы выводится указанная сумма с премией в 50%.

Сделайте так, чтобы в тот месяц, когда получилась зарплата в $666 цикл после вывода прерывался.

Пример работы программы (у вас должно быть так же, до символа):

Какую вы хотите зарплату в $$$?
2000
За месяц 0 начислено $0.0
За январь начислено $3000.0
За февраль начислено $3000.0
За март начислено $3000.0
За апрель начислено $3000.0
За май начислено $3000.0
За июнь начислено $2000.0
За июль начислено $2000.0
За август начислено $2000.0
За сентябрь начислено $3000.0
За октябрь начислено $3000.0
За ноябрь начислено $3000.0
За декабрь начислено $3000.0
За месяц 13 начислено $0.0
За месяц 14 начислено $0.0

*/

import java.util.Scanner;

public class TaskC1 {
    public static void main(String[] args) {
        System.out.println("Какую вы хотите зарплату в $$$?");
        Scanner sc = new Scanner(System.in);
        double i = sc.nextInt();
        double bonus = (i / 2) + i;
        int w = 1, l = 1, aut = 1;
        String a = "За ";
        String c = "начислено $";
        if (i < 300 || i > 3000) {
            System.out.println("Мы вам перезвоним!");
        } else {
            for (int j = 0; j <= 14; j++) {

                if (j == 0 && w == 1) {
                    w++;
                    if (bonus == 666.0) {
                        System.out.println("За месяц 0 начислено $0.0\n" +
                                "За январь начислено $666.0");
                        break;
                    }
                    System.out.println("За месяц 0 начислено $0.0");
                    System.out.println(a + "январь " + c + bonus);
                    System.out.println(a + "февраль " + c + bonus);
                    System.out.println(a + "март " + c + bonus);
                    System.out.println(a + "апрель " + c + bonus);
                    System.out.println(a + "май " + c + bonus);

                }
                if (j == 6 && l == 1) {
                    System.out.println(a + "июнь " + c + i);
                    l++;
                    if (i == 666.0)
                        break;
                    System.out.println(a + "июль " + c + i);
                    System.out.println(a + "август " + c + i);
                }
                if (j == 9 && aut == 1) {
                    System.out.println(a + "сентябрь " + c + bonus);
                    System.out.println(a + "октябрь " + c + bonus);
                    System.out.println(a + "ноябрь " + c + bonus);
                    System.out.println(a + "декабрь " + c + bonus);
                    System.out.println("За месяц 13 начислено $0.0");
                    System.out.println("За месяц 14 начислено $0.0");
                    aut++;
                }


            }

        }


    }


}
