package by.it.bunasm.lesson02;

/* Нужно написать программу, которая вводит два числа с клавиатуры
и выводит их сумму на экран в виде

Ввод (это вы вводите с клавиатуры):
34 26

Вывод (это должна появится в консоли, обратите внимание на пробелы и слово Sum:
Sum = 26
*/
class TaskC1 {
    public static void main(String[] args) {
        System.out.print("34");
        System.out.print(" ");
        System.out.println("26");
        int sum = 20 + 6;
        System.out.print ("Sum = ");
        System.out.print (sum);
    }
    }
